/**
 * Copyright (c), 2012~2019 iot.10086.cn All Rights Reserved
 * @file    user.c
 * @date    2019/04/22
 * @brief   用户业务逻辑
 */

/*****************************************************************************/
/* Includes                                                                  */
/*****************************************************************************/
#include "c_types.h"
#include "func_ops.h"
#include "device.h"
#include "err.h"
#include "product_def.h"

/*****************************************************************************/
/* Local Definitions ( Constant and Macro )                                  */
/*****************************************************************************/
#define DEVICE_SN   "love_swl_001"

/*****************************************************************************/
/* Structures, Enum and Typedefs                                             */
/*****************************************************************************/

/*****************************************************************************/
/* Local Function Prototype                                                  */
/*****************************************************************************/

/*****************************************************************************/
/* Local Variables                                                           */
/*****************************************************************************/

/*****************************************************************************/
/* Global Variables                                                          */
/*****************************************************************************/

/*****************************************************************************/
/* External Functions and Variables                                          */
/*****************************************************************************/

/*****************************************************************************/
/* Function Implementation                                                   */
/*****************************************************************************/
/**
 * 设备事件回调函数
 * @param evt
 */
int32 device_evt_cb(struct device_event_t *evt)
{
    //printf("evt id is %d\n", evt->evt_id);

    return 0;
}

/**
 * 通信串口数据发送接口
 * @param data
 * @param data_len
 * @return
 */
int32 device_data_send_cb(uint8 *data, uint16 data_len)
{
    /** 通过和WiFi模组连接的通信串口发送数据*/
	
    return 0;
}

/***
  * @brief  主函数
  * @param  argc
  * @param  argv
  * @return
***/
int32 main(int32 argc, char **argv)
{
    int32 ret = ERR_OK;

    /** 初始化硬件和软件资源*/
    
    /** 和物设备初始化*/
    #ifdef  GSM_MODE
    ret = device_init(NULL, device_evt_cb, device_data_send_cb);
    #else
    ret = device_init(DEVICE_SN, device_evt_cb, device_data_send_cb);
    #endif
    if (ERR_OK != ret)
        return -1;
    
    /** 开始调用device_data_recv()接收串口数据*/
    
    /** 设备消息处理、配网与数据上传*/
    while (1)
    {
        ret = device_step();     
        /** 根据外部触发或用户逻辑决定是否需要调用device_smartconfig()进行配网*/
        
        /** 检查是否需要上传数据。如果需要则调用对应的upload函数*/
        //func_xxx_upload();
    }
}
